// ConsoleOutput.cpp

#include "ConsoleOutput.h"
#include <cstdlib>

// Метод для отображения рук всех игроков
/*
ConsoleOutput::: Это указывает, что displayHands является методом класса ConsoleOutput.

std::unique_ptr обеспечивает единоличное владение объектом. 
Это означает, что уникальный указатель автоматически освобождает
память, когда объект больше не нужен (например, когда вектор players уничтожается).
а также Отсутствие необходимости вручную отслеживать и освобождать память делает код более 
безопасным и менее подверженным ошибкам.
*/
void ConsoleOutput::displayHands(const std::vector<std::unique_ptr<Player>>& players) const {
    system("cls");
    // Перебор всех игроков и отображение их рук
    for (size_t i = 0; i < players.size(); ++i) 
    {
        // Вывод руки игрока с указанием имени
        players[i]->displayHand((i == 0) ? "у Вас" : "у Дилера");
    }
}

// Метод для отображения текстового сообщения
void ConsoleOutput::displayMessage(const std::string& message) const 
{
    // Вывод текстового сообщения с новой строки
    std::cout << message << std::endl;
}
// Метод для отображения исключения (ошибки)
void ConsoleOutput::displayException(const std::exception& ex) const 
{
    // Вывод сообщения об исключении в поток ошибок
    std::cerr << "Исключение: " << ex.what() << std::endl;
}

// Метод для отображения заставки
void ConsoleOutput::displaySplashScreen() 
{
    // Вывод текста заставки (здесь использованы строки R"(...)" для многострочного литерала)
    std::cout << R"(
  *****************************************************************************************
  *                                                                                       *
  *           $$$$$  $$      $$$$   $$$$  $$  $$    $$$$$$  $$$$   $$$$  $$  $$           *
  *           $$  $$ $$     $$  $$ $$  $$ $$ $$         $$ $$  $$ $$  $$ $$ $$            *
  *           $$$$$  $$     $$$$$$ $$     $$$$          $$ $$$$$$ $$     $$$$             *
  *           $$  $$ $$     $$  $$ $$  $$ $$ $$     $$  $$ $$  $$ $$  $$ $$ $$            *
  *           $$$$$  $$$$$$ $$  $$  $$$$  $$  $$     $$$$  $$  $$  $$$$  $$  $$           *
  *                                                                                       *
  *****************************************************************************************

)";
}
// Метод для отображения экрана приветствия
void ConsoleOutput::displayWelcomeScreen() 
{
    std::cout << R"(
  *****************************************************************************************
  *                                                                                       *
  *                 $$   $$ $$$$$   $$       $$$$    $$$$   $$   $$ $$$$$                 *
  *                 $$   $$ $$      $$      $$  $$  $$  $$  $$$ $$$ $$                    *
  *                 $$ $ $$ $$$$    $$      $$      $$  $$  $$ $ $$ $$$$                  *
  *                 $$$$$$$ $$      $$      $$  $$  $$  $$  $$   $$ $$                    *
  *                  $$ $$  $$$$$   $$$$$$   $$$$    $$$$   $$   $$ $$$$$                 *
  *                                                                                       *
  *****************************************************************************************
  =========================================================================================
  =======                       Игра BlackjackGame началась!                        =======
  =========================================================================================

)";
}
// Метод для отображения экрана победы
void ConsoleOutput::displayWonScreen() 
{
    std::cout << R"(
  *****************************************************************************************
  *                                                                                       *
  *                  $$  $$   $$$$   $$  $$       $$   $$  $$$$   $$  $$                  *
  *                   $$$$   $$  $$  $$  $$       $$   $$ $$  $$  $$$ $$                  *
  *                    $$    $$  $$  $$  $$       $$ $ $$ $$  $$  $$ $$$                  *
  *                    $$    $$  $$  $$  $$       $$$$$$$ $$  $$  $$  $$                  *
  *                    $$     $$$$    $$$$         $$ $$   $$$$   $$  $$                  *
  *                                                                                       *
  *****************************************************************************************


)";
}
// Метод для отображения экрана поражения
void ConsoleOutput::displayLostScreen() 
{
    std::cout << R"(
  *****************************************************************************************
  *                                                                                       *
  *              $$  $$   $$$$   $$  $$       $$       $$$$    $$$$   $$$$$$              *
  *               $$$$   $$  $$  $$  $$       $$      $$  $$  $$        $$                *
  *                $$    $$  $$  $$  $$       $$      $$  $$   $$$$     $$                *
  *                $$    $$  $$  $$  $$       $$      $$  $$      $$    $$                *
  *                $$     $$$$    $$$$        $$$$$$   $$$$    $$$$     $$                *
  *                                                                                       *
  *****************************************************************************************

)";
}
// Метод для отображения экрана ничьи
void ConsoleOutput::displayTieScreen() 
{
    std::cout << R"(
  *****************************************************************************************
  *                                                                                       *
  *                               $$$$$$  $$$$$$  $$$$$                                   *
  *                                 $$      $$    $$                                      *
  *                                 $$      $$    $$$$                                    *
  *                                 $$      $$    $$                                      *
  *                                 $$    $$$$$$  $$$$$                                   *
  *                                                                                       *
  *****************************************************************************************

)";
}